{"CCT109H5": {"courseTitleFull": "CCT109H5F - Contemporary Communication Technologies (SSc)", "courseDetails": "This course examines different information and communication technologies (ICTs) through the analysis of such genres as contemporary written, visual, oral, electronic and musical forms.  It illustrates a range of theoretical perspectives that seek to explain the relationship between communication and technology. This course will also examine, briefly, the history of ICTs. [24L, 11P]", "coursePrerequisites": "None", "tags": "No Tags"}, "CCT111H5": {"courseTitleFull": "CCT111H5S - Critical Coding (SSc EXP)", "courseDetails": "This experiential learning course introduces students to the practice and theory of coding, programming, and basic development of user-oriented software. The lectures illustrate a core range of software development concepts that provide the foundations needed for the practical coding of front-end applications such as mobile interfaces or of back-end software such as introductory artificial intelligence or social media analysis. The practicals are lab-based and focus on applying these theoretical skills to solving problems grounded in a critical understanding of the interaction between people, culture, and society, by developing software or apps in languages such as Java, Objective C, Swift, Python. [24L, 12P]Corequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "None", "tags": ["Programming", "Software", "Experiential", "Media"]}, "CCT202H5": {"courseTitleFull": "CCT202H5F - Human-Machine Communication (SSc)", "courseDetails": "From voice responsive cars and virtual assistants to social robots and smart toys, people are increasingly and interacting with communicative technologies in their daily lives. In this course students will consider the implications of this evolution in communication practice – informing design, ethics, efficacy, privacy, and other implications. Human-machine  communication is a specific area of study within communication encompassing human-computer interaction, human-robot interaction, and human-agent interaction.[24L]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Human"]}, "CCT204H5": {"courseTitleFull": "CCT204H5F - Design Thinking I (SH) (SSc)", "courseDetails": "An introduction to the basic concepts and skills of design thinking as an interdisciplinary subject. Emphasizes creative and critical thinking in the design process; provides the student with the theory and operational skills necessary to solve design problems in the realms of symbolic and visual communication, material objects, environments, and organized services and activities. [24L, 12P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design"]}, "CCT208H5": {"courseTitleFull": "CCT208H5F - Communications Research Methods (SSc)", "courseDetails": "This course is a critical survey of research methodologies in the field of communication and media. A central goal of the course is to train students to collect, manage, analyze and interpret social science research data.  Each week students are required to attend a one hour in-class lecture and view a one hour online lecture. The online lectures will be posted at least one week before the week in which they are assigned. [24L, 8T]Exclusion: CCT203H5Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Research", "Management", "Media"]}, "CCT210H5": {"courseTitleFull": "CCT210H5F - Signs, Referents, and Meaning (SSc)", "courseDetails": "How written or spoken statements, gestures, and aesthetic objects come to have meanings. How we recognize and fail to recognize such meanings. The nature, systems, and processes of interpretation. The role of mental models. [24L, 11T]Exclusion: CCT213H5 or VIC223YIPrerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": "No Tags"}, "CCT221H5": {"courseTitleFull": "CCT221H5F - Digital Marketing I (DEM) (SSc)", "courseDetails": "Techniques for developing a comprehensive marketing strategy will be developed with particular emphasis on digital products and services. The nature of digital markets, approaches to advertising, pricing and such areas as versioning will also be discussed. [24L]Exclusion: MGT252H5 or MGT352H5Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Market", "Advertising"]}, "CCT222H5": {"courseTitleFull": "CCT222H5F - Political Economy of Communication, Culture, and Technology (SSc)", "courseDetails": "The course analyzes the relationship between media systems, communication technologies, and power.  As an introduction to a political economy approach, this course surveys how media, culture, information and technologies are produced, circulated, and consumed, with attention to both historical developments and contemporary practices in the digital era.  The course provides a basic understanding of media systems, technologies, and culture production in relation to the market, the state, and civil society.  Students will develop a basic understanding of the political, economic, cultural, and regulatory environment in which media, culture, and technologies are produced, and pay particular attention to the implications of processes such as globalization, digitization, marketization, and commodification for social life. [24L, 12T]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Politics", "Media", "Market"]}, "CCT224H5": {"courseTitleFull": "CCT224H5F - Organizational Studies I (DEM) (SSc)", "courseDetails": "This course provides a comprehensive overview of the activities and processes that take place in organizations.  Major emphasis is placed on the investigation of the varied measures that can be developed to assess and subsequently improve the performance of the organization.  The interpretation of measures in managerial decision-making will also be investigated in detail.  [24L]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Management"]}, "CCT250H5": {"courseTitleFull": "CCT250H5F - Technology and Creative Expression (SH) (SSc)", "courseDetails": "Advances in technology have provided users ready access to empowering technologies of creative expression.  This emergence of prosumer and amateur production technology has both destabilized and revolutionized established practice in digital imaging, time based media, gaming, and design.  This course provides a survey of contemporary theories, technologies and critical challenges in a variety of media of creative expression. [24L, 12P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Media"]}, "CCT260H5": {"courseTitleFull": "CCT260H5S - Web Culture and Design (SH) (SSc)", "courseDetails": "The course will explore how the web has influenced culture and how websites are designed and managed. Topics will include the presentation of text, graphics, audio and video on the web. Design, web server concepts, human communication systems and organizational contexts will be considered in creating web sites using scripting languages and web software tools. [36P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Software", "Design", "Human", "Management"]}, "CCT270H5": {"courseTitleFull": "CCT270H5S - Principles in Game Design (SH) (SSc)", "courseDetails": "An overview of videogame theory, best practices, emergent trends and technology, with strong participation by industry professionals.  This course features a variety of guest speakers addressing different facets of game design, supported by later discussion and analysis.  Students will experience a broad overview of principles in game design that may inspire further development and design activities in related game design courses. [36L]\r\n\r\nPrerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Game"]}, "CCT285H5": {"courseTitleFull": "CCT285H5F - Immersive Environment Design (SSc)", "courseDetails": "Students will develop skills in the areas of bitmap/vector graphics, audio/visual production and editing, 2D/3D modeling and animation, and video game design. Students will produce immersive environments while addressing and engaging issues of remix culture and intellectual property. [24L, 12P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Game"]}, "CCT302H5": {"courseTitleFull": "CCT302H5F - Developing and Managing Communication Campaigns and Projects (SSc)", "courseDetails": "Communication campaigns and projects, whether they involve marketing, politics, or advertising require the establishment of objectives, tasks, and milestones. Furthermore developing and managing campaigns requires the development of knowledge and skills relating to the management of teams. Students will acquire analytic skills allowing them to understand the development and management of communication campaigns and projects. Current theory and research will comprise an integral part of the course as will study of the appropriate software tools.  A significant component of the assessment for this course will be a group project that will involve the design of a communication campaign or project which will be presented to a group of experts. [24L]\r\n\r\nPrerequisites: A minimum of  8.0 university credits.", "coursePrerequisites": "A minimum of  8.0 university credits.", "tags": ["Software", "Design", "Research", "Politics", "Management", "Market", "Advertising"]}, "CCT303H5": {"courseTitleFull": "CCT303H5S - Communicating In and Between Organizations (SSc)", "courseDetails": "This course examines the nature of communications in organizations.  Communications are the glue that holds organizations together. Understanding theoretically and practically the multi-faceted functions of communication in and between organizations is essential for anyone seeking to develop a career in an organization whether it be private or public. Students will acquire analytic skills allowing them to understand organizational communication from a variety of different perspectives. They will also be required to develop and actively critique practical examples of organizational communication. [24L]\r\nPrerequisites: CCT210H5 or CCT218H5", "coursePrerequisites": "CCT210H5 or CCT218H5", "tags": "No Tags"}, "CCT304H5": {"courseTitleFull": "CCT304H5F - Visual Communication and Digital Environments (SSc EXP)", "courseDetails": "This is a project-based course that focuses on analyzing and evaluating the persuasive impact of the images we use every day to make decisions about our social networks, what we buy, how we live, what we care about, and who we are.  Students will learn about rhetorical devices used in visual communications and then work in teams to create a persuasive awareness campaign for an NGO, Government Agency, Healthcare organization or other social interest group as the final project. [24L, 8T]Prerequisites: CCT210H5", "coursePrerequisites": "CCT210H5", "tags": "No Tags"}, "CCT308H5": {"courseTitleFull": "CCT308H5F - Advanced Research Methodologies (SSc EXP)", "courseDetails": "This course provides students with an in-depth study and critical analysis of research methodologies within the discipline of communications and new media.  Students will learn to explicitly identify generalizable findings, ethical concerns, study limitations, and new contributions to the field of knowledge using existing studies in qualitative, quantitative and mixed methodologies.  Students will also gain experience in identifying and assessing problems within a research design and develop the ability to recommend revisions and/or new contexts and techniques for replicating the studies. [24L]Prerequisites: CCT208H5", "coursePrerequisites": "CCT208H5", "tags": ["Design", "Research", "Media"]}, "CCT311H5": {"courseTitleFull": "CCT311H5F - Game Design and Theory (SH) (SSc)", "courseDetails": "This course will address the principles and methodologies behind the rules and play of games.  The lectures and practical work will foster a solid understanding of how games function to create experiences, including rule design, play mechanics, game balancing and the integration of visual, tactile, audio and textual components into games.\r\n[36L]Prerequisites: CCT270H5", "coursePrerequisites": "CCT270H5", "tags": ["Design", "Game"]}, "CCT314H5": {"courseTitleFull": "CCT314H5F - Mind, Media and Representation (HUM SSc)", "courseDetails": "This course applies a variety of theoretical and practical approaches to consider the multiple  and often conflicting ways representations in media are produced and consumed. The study of representations is approached from the perspective that they are best understood as both discursive\r\nand ideological.  Questions to be examined include: What does it mean for historical and contemporary representations to carry economic, ideological and discursive power? To what extent do audiences hold power to resist or negotiate with representations? How might we interrogate the notion that we live in a post-feminist, post-racialized society in which older ideas about gender, race and power no longer apply or need re-thinking? [24L, 5T]\r\n\r\n\r\nPrerequisites: A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "coursePrerequisites": "A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "tags": ["Media"]}, "CCT320H5": {"courseTitleFull": "CCT320H5F - Communication, Technology, and Social Change (SSc)", "courseDetails": "This course explores how media and media technology have shifted the nature of the existing political and social orders,  We will focus on how social movements and political challengers have used media to disrupt and, in many cases, overthrow leaders, corporations, and governments.  This will bring us in contact with theories of social movement mobilization, political communication, and digital media.  We will also explore the ways that legacy and digital media have changed to be in service of misinformation and state repression.  [24L]Prerequisites: CCT218H5 or CCT222H5", "coursePrerequisites": "CCT218H5 or CCT222H5", "tags": ["Politics", "Media"]}, "CCT335H5": {"courseTitleFull": "CCT335H5F - Technology and the City  (SSc)", "courseDetails": "Technology continues to reshape the physical contours of our built environments as much as it redefines our conceptualization of how we inhabit and interact within them.  This course investigates how urban form, space, infrastructure and communication are mediated by new and evolving technologies. [24L,11T]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Media"]}, "CCT336H5": {"courseTitleFull": "CCT336H5F - Comics and Digital Culture (SH) (SSc)", "courseDetails": "Examining the medium of comics and graphic novels and its evolution in an era of digital production and dissemination.   Starting from a foundational understanding of the visual grammar of comics, students create their own graphic narratives and later explore the dynamics of digital dissemination by creating viral and memetic content for an Internet audience. [36L]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": "No Tags"}, "CCT351H5": {"courseTitleFull": "CCT351H5S - Theory and Practice of Animation (SH) (SSc)", "courseDetails": "This course introduces the student to the history of animation from the earliest exploration of the animated image in the early 1900's to the most current computer, traditional and web-based practices. This course will focus on important stylistic, narrative and technological developments. [36L]Prerequisites: A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "coursePrerequisites": "A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "tags": "No Tags"}, "CCT352H5": {"courseTitleFull": "CCT352H5F - History and Practice of Design (SH) (SSc)", "courseDetails": "This course examines the historical development of communication design from the industrial revolution to the present. The student will focus on the emergence of design practice and theory in changing economic, technological and social contexts. [36L]Prerequisites: CCT204H5", "coursePrerequisites": "CCT204H5", "tags": ["Design"]}, "CCT353H5": {"courseTitleFull": "CCT353H5S - Digital Media:  Video (SH) (SSc)", "courseDetails": "This course will explore the theoretical and practical aspects of producing narrative time based imagery within a digital environment. The conceptual and digital tools as well as workflows and delivery systems that have been developed to produce images will be explored. [48P]Prerequisites: A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "coursePrerequisites": "A minimum of 8.0 university credits including CCT109H5 and CCT110H5.", "tags": ["Media"]}, "CCT356H5": {"courseTitleFull": "CCT356H5S - Online Advertising and Marketing (SH) (SSc)", "courseDetails": "This course investigates the industrial practices and tools of effectively marketing and promoting goods and services online.  Topics include analysis of contemporary online advertisement design, the effective use of social media technologies in product marketing, planning online campaigns that reinforce and complement existing marketing and advertising efforts, and understanding key metrics used to evaluate a campaign's effectiveness. [36L]Exclusion: CCT354H5Prerequisites: CCT260H5", "coursePrerequisites": "CCT260H5", "tags": ["Design", "Media", "Market", "Advertising"]}, "CCT357H5": {"courseTitleFull": "CCT357H5S - Digital Media: Photography (SH) (SSc)", "courseDetails": "This course will explore the theoretical and practical aspects of producing theme based single and sequential imagery within a digital environment. We will explore the conceptual and digital tools as well as workflows and delivery systems that have been developed to produce images. [48P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Media"]}, "CCT360H5": {"courseTitleFull": "CCT360H5F - Intermediate Web Design (SH) (SSc)", "courseDetails": "This course builds upon the concepts introduced in Web Culture and Design and expands upon them to include the theory and practical aspects of creating modern, compliant standards for websites.  Its focus is primarily on the design and presentation of websites on the client side.  Students will learn how to develop websites for consumption on various platforms including desktop browsers, mobile devices, etc. [36P]Prerequisites: CCT260H5", "coursePrerequisites": "CCT260H5", "tags": ["Design", "Media"]}, "CCT380H5": {"courseTitleFull": "CCT380H5F - Human-Computer Interaction and Communication (SSc EXP)", "courseDetails": "The emphasis in this course will be on theoretical, methodological, and empirical issues in the study of Human-Computer Interaction.  Intelligent interface designs, usability assessment, user modeling and the accessibility of the technology for the disabled are among the topics to be examined.  Related behavioural investigations concerning the ease and efficiency of users' interactions with computerized environments will also be discussed. [36P]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Human"]}, "CCT382H5": {"courseTitleFull": "CCT382H5F - Prototyping Digital Games   (SSc)", "courseDetails": "This course explores the fundamentals of the process of game design through prototyping. It focuses on the contexts and components of game design, such as design iteration and user testing along relevant dimensions such as art style, narrative, and game balance. Students will be introduced to design across different genres and types of digital games, including games for education, serious games, indie, and AAA games. Working in collaborative groups, students will learn and practice the appropriate methodology to design game mechanics, characters, art assets and other appropriate deliverables in order to create a game or high-fidelity prototype. [24L]Prerequisites: CCT218H5", "coursePrerequisites": "CCT218H5", "tags": ["Design", "Game"]}, "CCT404H5": {"courseTitleFull": "CCT404H5S - Integrative Design Project  (SSc EXP)", "courseDetails": "This project-based course aims to demonstrate how collaboration is a critical capability often overlooked. During the course students will integrate their learning and experience and first hand see how, in combination with collaboration it can lead to creatively solving problems in areas as varied as business, health care delivery, urban planning and development.  In addition to lectures, students will have the benefit of a series of guest lecturers.  A large, group based project will serve to integrate learning and allow students the benefit of experiential learning. [36L]Prerequisites: A minimum of 13.0 credits.Recommended Prep: CCT204H5", "coursePrerequisites": "A minimum of 13.0 credits.Recommended Prep: CCT204H5", "tags": ["Design", "Experiential"]}, "CCT405H5": {"courseTitleFull": "CCT405H5S - Individual Project (SSc)", "courseDetails": "A research project carried out under the supervision of a faculty member.  Students will carry out a research project on a selected topic related to CCIT.  Students must obtain signed permission from the faculty member who they would like to have as their supervisor.Enrolment is limitedExclusion: CCT401H5Prerequisites: Completion of 13.0 university credits.", "coursePrerequisites": "Completion of 13.0 university credits.", "tags": ["Research"]}, "CCT410H5": {"courseTitleFull": "CCT410H5S - CCIT Internship I (SSc EXP)", "courseDetails": "This course is a practical internship and is available only upon application from students registered in the CCIT/DEM programs. Through a placement, students will apply the expertise in communication, culture, and information technology that they have gained through previous courses. Students must plan well in advance for the placement and work closely with the placement officer for CCIT to determine eligibility and suitability. A report and presentation will be required at the end of the placement. These, along with the employer's assessment, will provide the main part of the course mark. [14S]Exclusion: CCT409H5Prerequisites: Completion of 13.0 university credits and minimum CGPA 2.5 and permission of internship coordinator.", "coursePrerequisites": "Completion of 13.0 university credits and minimum CGPA 2.5 and permission of internship coordinator.", "tags": ["Programming", "Internship"]}, "CCT412H5": {"courseTitleFull": "CCT412H5S - Self-Directed Research Project: Advanced Studio Practices (SH) (SSc)", "courseDetails": "This course facilitates a student-led research project to be carried out under the supervision of a faculty member.  This is an opportunity to develop a critical and practical perspective on selected issues and practices within CCIT.  Students design and implement an advanced project on a topic of interest using advanced creative and critical production skills.  The aim is to redefine and articulate critical ideas through the process of making creative work. Students must obtain signed permission from a potential supervising faculty member.Prerequisites: 1.0 credit from CCT305H5 or CCT351H5 or CCT353H5 or CCT357H5 or CCT360H5.", "coursePrerequisites": "1.0 credit from CCT305H5 or CCT351H5 or CCT353H5 or CCT357H5 or CCT360H5.", "tags": ["Design", "Research"]}, "CCT419H5": {"courseTitleFull": "CCT419H5F - User Experience Design - UXD and Board Games (SSc)", "courseDetails": "This course allows students to explore issues related to user interface, user experience, materiality, gamification and game theory. Board games represent a space to consider social interaction, the use of materials, the role of emotion in design (UX), knowledge sharing and the role gamification plays in influencing behaviour. Students will be exposed to professional and research publications related to design, game theory, user experience and game mechanics. [36S]Prerequisites: A minimum of 8.0 university credits including CCT210H5 or CCT218H5 or CCT380H5 or CCT382H5.", "coursePrerequisites": "A minimum of 8.0 university credits including CCT210H5 or CCT218H5 or CCT380H5 or CCT382H5.", "tags": ["Design", "Research", "Game"]}, "CCT420H5": {"courseTitleFull": "CCT420H5F - Information Technology and Globalization (SSc)", "courseDetails": "The variety of ways in which various information technologies influence and are influenced by globalization will be critically examined.  The class will explore metaphors or ways of thinking about society and technology to critically examine the complex process and the diverse consequences of globalization.  Topics may shift focus yearly but will include the economy, culture, politics, social movements, migration, social identity, war and global conflict, etc. [24L]Prerequisites: A minimum of 13.0 university credits including CCT109H5 and CCT110H5.", "coursePrerequisites": "A minimum of 13.0 university credits including CCT109H5 and CCT110H5.", "tags": ["Politics"]}, "CCT432H5": {"courseTitleFull": "CCT432H5F - Ethics and Code (SSc)", "courseDetails": "A self-driving car should always protect pedestrians, even if that implies serious threat for the vehicle's passengers. Current ethical challenges within our computational cultures has brought forward dilemmas involving code such as designing killer robots, the use of technology to predict and prevent crimes before they happen, and platform surveillance in social media.  Students in this course will use theories and case based examples to examine questions such as what is meant with ethics in new media and critical computing, can we program computational systems according to ethical models, and does digital culture force us to rethink what ethics are? [24L] Prerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": ["Programming", "Design", "Media"]}, "CCT433H5": {"courseTitleFull": "CCT433H5F - Sustainable Design (SH) (SSc)", "courseDetails": "This course immerses students in sustainable design methodologies based upon whole systems analysis, applying the quadruple bottom line of people, profit, planet, and culture to understand and design for environmental issues and social change. During this course, students will apply the process and rhetoric of sustainable systems thinking to the re-design of an object or service applying such  methodologies as cradle-to-cradle, 'design-for-environment', pricing based on full cost accounting, greening of the supply chain, and corporate responsibility. Throughout the course, students will examine the need for sustainable design through case studies, best practice analyses, and relevant readings. [36L]Prerequisites: A minimum of 13.0 university credits including (CCT204H5 or CCT250H5)", "coursePrerequisites": "A minimum of 13.0 university credits including (CCT204H5 or CCT250H5)", "tags": ["Design"]}, "CCT448H5": {"courseTitleFull": "CCT448H5F - Game Design as Problem Solving (SH) (SSc)", "courseDetails": "In this course, learners will identify and analyze the problems associated with game design such as The Door Problem and The Stamp Collecting Dilemma. Applying their own creativity and various schools of game theory such as Player-Centric Design, learners will prepare game mechanics that address and attempt to solve these problems.  [36P]Prerequisites: CCT311H5", "coursePrerequisites": "CCT311H5", "tags": ["Design", "Game"]}, "CCT450H5": {"courseTitleFull": "CCT450H5F - Designing Interactive Books (SH) (SSc)", "courseDetails": "This advanced self-directed project-based course allows students who are already familiar with the principles of page layout and interactive multimedia to design and publish in iBooks. The principles and practice of creative concept development and art direction are actively applied. Students will develop original content in text, digital media, and engage in the creative application of iBooks Author's widgets as a writer, editor, illustrator, and designer. Balancing an industry-ready mindset with an avant-garde spirit, students are also encouraged to investigate this medium as an art form in alternative, experimental directions. [36P]\r\n\r\nPrerequisites: CCT204H5 and CCT305H5", "coursePrerequisites": "CCT204H5 and CCT305H5", "tags": ["Design", "Media"]}, "CCT453H5": {"courseTitleFull": "CCT453H5F - Digital Media:  Advanced Video Production (SH) (HUM)", "courseDetails": "This course focuses on advanced theoretical and practical aspects of video production and editing.  Storytelling techniques, the relationship of form to content, and montage strategies will be investigated.  Over the course of the term students will work in teams to direct, film and edit video using digital technologies. [48P]Prerequisites: CCT353H5", "coursePrerequisites": "CCT353H5", "tags": ["Media"]}, "CCT470H5": {"courseTitleFull": "CCT470H5F - Information Visualization  (SSc)", "courseDetails": "Visual literacy and the visualization of information are increasingly important competencies in a growing number of fields. This course will explore the history of visually representing information, consider issues related to data visualization and approaches to visually representing data. In addition, students will develop a better understanding of what visualization works best for various types of data, what makes for a strong visualization and the importance of narrative in the construction of graphic data representation. [24P]Prerequisites: CCT210H5 and (CCT226H5 or CCT286H5 or CCT304H5)", "coursePrerequisites": "CCT210H5 and (CCT226H5 or CCT286H5 or CCT304H5)", "tags": "No Tags"}, "CCT472H5": {"courseTitleFull": "CCT472H5F - Media Archaeology (SSc)", "courseDetails": "This course examines media as technical objects with specific histories and a contemporary presence.  Through historical texts, archival research and hands-on experimentation, old media will be brought to life.  Phonographic records players, cassette tape machines, portable radios, and 16-bit video-game consoles are examples of the kinds of media examined in this course. [24L,12T]Prerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": ["Research", "Media", "Game"]}, "CCT473H5": {"courseTitleFull": "CCT473H5F - Career Strategies (SSc)", "courseDetails": "In this course students will learn about various challenges that new graduates, future managers, and future executives will face in the workplace.  Students will learn the theoretical as well as practical techniques that will help them succeed after graduating from their undergraduate programs. [24L]Prerequisites: Minimum of 13.0 credits.", "coursePrerequisites": "Minimum of 13.0 credits.", "tags": ["Programming", "Management"]}, "CCT490H5": {"courseTitleFull": "CCT490H5F - Topics in Communication, Culture and Information Technology (SSc)", "courseDetails": "An in-depth examination of selected topics in communication, culture and information technology. Topics vary from year to year, and the content in any given year depends upon the instructor. [24S]Prerequisites: A minimum 13.0 university credits.", "coursePrerequisites": "A minimum 13.0 university credits.", "tags": "No Tags"}, "CCT495H5": {"courseTitleFull": "CCT495H5F - Topics in Communication, Culture, Information & Technology (SSc)", "courseDetails": "An in-depth examination of selected topics in communication, culture, information and technology.  Topics vary from year to year and the content in any given year depends on the instructor. [24L]Prerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": "No Tags"}, "MGD428H5": {"courseTitleFull": "MGD428H5F - Project Management (SSc)", "courseDetails": "Approaches to the management of complex technical projects will be investigated. Topics include project estimating, costing and evaluation, organizing and managing project teams, quantitative methods for project planning and scheduling, introduction to computer-based project management tools. The course may involve an applied field project. [24L] Prerequisites: MGM101H5 and (CCT324H5 or MGT262H5) and (CCT225H5 or MGT371H5)", "coursePrerequisites": "MGM101H5 and (CCT324H5 or MGT262H5) and (CCT225H5 or MGT371H5)", "tags": ["Management"]}, "CCT110H5": {"courseTitleFull": "CCT110H5S -  Rhetoric and Media  (SSc)", "courseDetails": "This course critically examines the written, visual, aural, and dynamic rhetoric as it pertains to communications for academic and other purposes across a range of digital and interactive media discourses. [24L, 11T]Prerequisites: CCT109H5", "coursePrerequisites": "CCT109H5", "tags": ["Media"]}, "CCT200H5": {"courseTitleFull": "CCT200H5S - Race, Media and Culture (SSc)", "courseDetails": "This course provides an introduction to the intersecting fields of critical race, media, and cultural studies. We will pay particular attention to dynamics of social difference and power and the communication strategies and technologies through which these are navigated, reproduced and interrupted. Students will be introduced to critical and analytical tools for understanding the cultural and media circulation, regulation and reimagination of things like race, sexuality, time, gender, class, indigeneity, space, ethnicity, ability and nationality. These critical tools equip students with the skills to write, design and build ethical innovations in new media and culture. [24L, 11T]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Design", "Media"]}, "CCT206H5": {"courseTitleFull": "CCT206H5S - Law, Technology and Culture (SSc)", "courseDetails": "This course will provide a detailed review of copyright, trademark and patent law with a special emphasis on how they apply to digital media.  This course will also review the law of contract as it applies to digital industries and investigate the relevant tort law. In addition, other regulatory issues will be discussed such as telecommunications and broadcasting law both from a Canadian and an international perspective. [24L, 11T]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Media"]}, "CCT211H5": {"courseTitleFull": "CCT211H5S - Fundamentals of User Interface Programming (SSc EXP)", "courseDetails": "This experiential learning course introduces students to the practice and theory of coding, programming, and development of user interfaces. The lectures illustrate an advanced range of software development concepts needed for the practical coding of user interfaces across a variety of devices. The practicals are lab-based and focus on applying these theoretical skills to design, implementation, and testing of user interface software components. Students will have the opportunity to acquire project management and software engineering skills Scrum, Agile), programming languages (Java, Javascript, Objective C, Swift, and other mobile and web programming languages), and evaluation methodologies (unit testing, bug tracking). [24L, 12P]Prerequisites: CCT109H5 and CCT110H5 and CCT111H5", "coursePrerequisites": "CCT109H5 and CCT110H5 and CCT111H5", "tags": ["Programming", "Software", "Design", "Experiential", "Management"]}, "CCT212H5": {"courseTitleFull": "CCT212H5S - Hacker Culture (SSc)", "courseDetails": "By subverting and re-appropriating technologies, hackers influence both the evolution of computing and the politics of digital media.  Hacking contributes to shaping the future of entrepreneurship, free speech, surveillance, and intellectual property.  The course will examine the cultural, social, and legal facets of hacking in fields ranging from software production to political activism and the hacker underground.  It will be based on social science research on hackers as well as concrete examples of data re-appropriation and technology modification. [24L]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Software", "Research", "Politics", "Media"]}, "CCT218H5": {"courseTitleFull": "CCT218H5S - Foundations of Media and Technology Studies (SSc)", "courseDetails": "An introduction to foundational theories for studying the relationship between media, technology and society. The course presents technology as a social practice and considers a wide variety of concepts and methods for studying its cultural and political significance. [24L, 11T]\r\n\r\nPrerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Politics", "Media"]}, "CCT225H5": {"courseTitleFull": "CCT225H5S - Information Systems (DEM) (SSc)", "courseDetails": "This course has been designed to provide students with a basic understanding of the role of computers and communication systems in modern organizations. Unlike programming courses, the focus here is on the application of computer-based systems to support information requirements for problem solving and managerial decision-making. Topics include concepts of information, humans as information processors, survey of hardware and software applications, introduction to information systems analysis and design. [24L, 12T]Exclusion: CCT325H5 or MGM371H5 or MGT371H5 or RSM327H1 or MGAC70H3Prerequisites: CCT224H5", "coursePrerequisites": "CCT224H5", "tags": ["Programming", "Software", "Design", "Human", "Management"]}, "CCT273H5": {"courseTitleFull": "CCT273H5S - Professional Practice and Communication (SSc)", "courseDetails": "This professional practice course provides students with basic skills in professional communication, acumen, and problem solving that will help them develop personally and professionally. [24L]Prerequisites: 70% in CCT110H5 or WRI203H5, departmental approval.", "coursePrerequisites": "70% in CCT110H5 or WRI203H5, departmental approval.", "tags": "No Tags"}, "CCT286H5": {"courseTitleFull": "CCT286H5S - Interactive Media Design  (SSc)", "courseDetails": "This course provides students with the opportunity to learn the skills necessary to produce responsive web content.  Students will develop skills in the areas of website design, interactive and animated web content, mobile app development, and mobile game development. [36P]Prerequisites: CCT109H5 and CCT110H5 and CCT285H5", "coursePrerequisites": "CCT109H5 and CCT110H5 and CCT285H5", "tags": ["Design", "Media", "Game"]}, "CCT300H5": {"courseTitleFull": "CCT300H5S - Critical Analysis of Media  (SSc)", "courseDetails": "This course offers an overview of critical theoretical concepts and applies them to contemporary media. Students will use concepts from social theory, media studies and technology studies to critically analyze the many facets of the evolution and pervasiveness of digital media. [24L]Prerequisites: CCT210H5 or CCT218H5", "coursePrerequisites": "CCT210H5 or CCT218H5", "tags": ["Media"]}, "CCT305H5": {"courseTitleFull": "CCT305H5S - Design and Implementation of Multimedia Documents (SH) (SSc)", "courseDetails": "The principles and techniques of user-centered, functional design are introduced and applied to the analysis of software interfaces and the creation of multimedia documents. The roles of shared metaphors and mental models in clear, concise and usable designs are emphasized. Students will produce multimedia documents, which make effective use of text, colour, user input, audio, still, and time-based images. [24L, 12P]Prerequisites: CCT204H5 or CCT250H5", "coursePrerequisites": "CCT204H5 or CCT250H5", "tags": ["Software", "Design", "Media"]}, "CCT310H5": {"courseTitleFull": "CCT310H5S - Popular Culture and Society (SSc)", "courseDetails": "How does consumerism affect symbolic production, circulation and transactions? Major modern theories of mass communication will be presented (Fiske, Bourdieu, Benjamin, Jenkins, Frankfurt school, and Marxist approaches). Students will explore new structures of mass communication in relation to popular culture systems, and their economic, technological and institutional dimensions. Topics include Disney, Hollywood, celebrity culture, social media, and user generated content in digital environments.  [24L]Prerequisites: CCT210H5", "coursePrerequisites": "CCT210H5", "tags": ["Media"]}, "CCT312H5": {"courseTitleFull": "CCT312H5S - Interactive Story Telling for Game Development (SH) (SSc)", "courseDetails": "This course will address traditional storytelling and the challenges of interactive narrative.  Students will develop a solid understanding of traditional narrative theory as well as experimental approaches to storytelling in literature, theatre and film with relevance to game development. [36L]Prerequisites: CCT270H5", "coursePrerequisites": "CCT270H5", "tags": ["Game"]}, "CCT316H5": {"courseTitleFull": "CCT316H5S - Communication and Advertising (SSc)", "courseDetails": "A study of theories in communication and meaning with different reference to advertising, advertising messages, and advertising management. [24L]Prerequisites: CCT210H5", "coursePrerequisites": "CCT210H5", "tags": ["Management", "Advertising"]}, "CCT331H5": {"courseTitleFull": "CCT331H5S - Social Media and Society (SSc)", "courseDetails": "This course introduces students to critical approaches to social media drawing from theories and fields including software studies, platform studies, critical theory and political economy. The course provides students with tools and theories to analyze and understand current social media connectivity, and how social media platforms function as socio-cultural systems. [24L]Prerequisites: CCT218H5 or CCT222H5", "coursePrerequisites": "CCT218H5 or CCT222H5", "tags": ["Software", "Politics", "Media"]}, "CCT333H5": {"courseTitleFull": "CCT333H5S - Social Innovation(SH) (SSc)", "courseDetails": "This course introduces students to the strategies and processes of social innovation through usability studies, systems analysis, and artifact prototyping for new products or services for underserved groups. Students will learn various techniques of understanding user needs requirements and design methodologies, and apply this knowledge to create socially innovative prototypes to apply to real world situations. By the end of this course, students will have worked in groups to develop design alternatives for a technological artifact or system of their choosing, gain knowledge of human-centred design strategies and learn how to become change agents through case studies, best practice analyses, and relevant readings. [36L]Prerequisites: CCT250H5", "coursePrerequisites": "CCT250H5", "tags": ["Design", "Human"]}, "CCT334H5": {"courseTitleFull": "CCT334H5S - History and Theory of Game Production (SH) (SSc)", "courseDetails": "This course will examine the principles, theory and practice behind the production of games. By examining the history and contributions of early founders such as Atari and Activision, all the way to present-day leaders such as Electronic Arts and Sony, students will gain an understanding of how the global video game industry operates.  The lectures and practical work will foster an approach to the understanding of game production issues including technology, law, marketplace and audience demand. [36L]Prerequisites: CCT109H5 and CCT110H5", "coursePrerequisites": "CCT109H5 and CCT110H5", "tags": ["Market", "Game"]}, "CCT340H5": {"courseTitleFull": "CCT340H5S - Gender, Media and Technology (SSc)", "courseDetails": "This course brings a gendered lens to the study of media and technology. The course explores the (re)production and (re)presentation of gender through communicative practices in a variety of mediums, including print media, TV, activist media, video games and online platforms. The course develops an understanding of gender ideologies and how media, technologies, and communication help produce gender. The course examines the way gender identities are constructed by mainstream and alternative media; gendered divisions of media and digital labour; the relationship between ICTs and the performance of gender and sexuality; masculinities, gender politics; feminist theory; and the construction and negotiation of gender in relation to mediated environments. [24L]\r\n\r\nPrerequisites: CCT109H5 and CCT110H5 and (CCT200H5 or CCT210H5 or CCT222 or WRI203H5)", "coursePrerequisites": "CCT109H5 and CCT110H5 and (CCT200H5 or CCT210H5 or CCT222 or WRI203H5)", "tags": ["Politics", "Media", "Game"]}, "CCT341H5": {"courseTitleFull": "CCT341H5S - Introduction to IT Consulting   (SSc EXP)", "courseDetails": "Information Technology (IT) Consulting is a growing profession that embodies the use of computer-supported collaborative tools in the execution of business functions. In this course students engage with the principles of Computer Supported Co-operative Work (CSCW) through an experiential opportunity to work with a real client. Students create an IT Consulting company and take on the role of consultants, learning core skills (soft and hard) necessary for this profession, including client management, communication, ideation, analysis and solution development, project management, presentation skills, and web design. Using case studies we discuss consulting lessons learned and problems to avoid within the context of industry best practices. [24P]Prerequisites: Minimum of 8.0 university credits.", "coursePrerequisites": "Minimum of 8.0 university credits.", "tags": ["Design", "Experiential", "Management"]}, "CCT365H5": {"courseTitleFull": "CCT365H5S -  Surveillance  (SSc)", "courseDetails": "From the Orwellian Big Brother to Foucault's panopticon, surveillance has become an everyday facet of modern life.  From a surveillance studies perspective surveillance can be applied as a framework for understanding social, political, and technological interrelationships. This framework can  help us study more effectively power, identity, persuasion, and control associated with the spread of Information Communication Technologies (ICT's).  This course will introduce students to viewpoints, vision and visibility in surveillance studies. The class will look at a range of topics from information politics, identification, privacy, security, suspicion, social sorting, bodies, borders and biometrics to explore a range of perspectives under the surveillance studies umbrella.  It will introduce students to key issues surrounding data, discrimination, and visibility in a global context to undercover the watched world.   [24L]Prerequisites: CCT109H5 and CCT110H5 and CCT206H5 or CCT222H5", "coursePrerequisites": "CCT109H5 and CCT110H5 and CCT206H5 or CCT222H5", "tags": ["Politics"]}, "CCT371H5": {"courseTitleFull": "CCT371H5S - Sound as Media (SSc)", "courseDetails": "Sound as Media will provide students with an immersive introduction to the field of sound studies. The course offers a counterpoint to surveys of visual media by exploring acoustic technologies in historical, cultural and spatial context. By considering examples such as the gramophone, public address system, boombox, and MP3 player as well as the theories that account for them, students will develop an understanding of media forms that engage the ear as well as the eye. They will in turn, have the opportunity to apply this understanding to the final project which will give them hands-on experience with creating a sound-based documentary.  [24L]Prerequisites: A minimum of 8.0 university credits including CCT109H5 and CCT110H5 and CCT111H5.", "coursePrerequisites": "A minimum of 8.0 university credits including CCT109H5 and CCT110H5 and CCT111H5.", "tags": ["Media"]}, "CCT381H5": {"courseTitleFull": "CCT381H5S - Media Audiences (SSc)", "courseDetails": "Audiences are social constructions which must be imagined to be actualized. Beginning with an exploration of the nature and role of audiences from early 20th century media, students explore how audiences make meaning of popular media platforms today.  How are audiences situated within media texts, what role does this play in how media is generated and circulated, and how do audiences both enact and resist media influence?  Broadcast models, interactive models, audience reading, gender, culture, race, and audience feedback are investigated. [24L]\r\n\r\nPrerequisites: CCT210H5", "coursePrerequisites": "CCT210H5", "tags": ["Media"]}, "CCT384H5": {"courseTitleFull": "CCT384H5S - Inclusive Design and Social Responsibility (SH) (SSc)", "courseDetails": "The course provides an overview of inclusive design, a paradigm that empowers people of all ages and abilities.  By analyzing products, buildings and communities from an inclusive perspective and making the needs of people the central focus of the design process this new paradigm seeks to develop form from function to increase the usefulness and responsiveness of our physical world for a wider and more diverse range of people.  [36L] Prerequisites: CCT204H5", "coursePrerequisites": "CCT204H5", "tags": ["Design"]}, "CCT385H5": {"courseTitleFull": "CCT385H5S - Conceptualizing Media Environments  (SSc)", "courseDetails": "Marshall McLuhan was one of the first theorists to conceptualize media as environments.  Media were no longer conceptualized as instruments or tools but as systems that would capture their audience within.  This course investigates the role of media in structuring and conditioning how we inhabit environments.  From geology to ecology, from the umwelt to ecosystems, from urban to outer space, from bodies to biospheres, this class looks at media as modes of inhabitation.  The intersections of media and environments will thus be problematized in their social, cultural, and political dimensions.  Students  will be introduced to these systems from a conceptual and a practical perspective through the study of scientific, artistic and design projects.   [24L]Prerequisites: CCT218H5", "coursePrerequisites": "CCT218H5", "tags": ["Design", "Politics", "Media"]}, "CCT395H5": {"courseTitleFull": "CCT395H5S - Topics in Communication, Culture, Information & Technology  (SSc)", "courseDetails": "An in-depth examination of selected topics in communication, culture and information technology.  Topics vary from year to year, and the content in any given year depends upon the instructor. [24L]Prerequisites: Minimum of 8.0 university credits.", "coursePrerequisites": "Minimum of 8.0 university credits.", "tags": "No Tags"}, "CCT403H5": {"courseTitleFull": "CCT403H5S - Finance, Innovation and the Digital Firm (SSc)", "courseDetails": "Students will learn about financial aspects of digital industries. They will gain knowledge about how financial and other incentives shape the decisions of agents in the digital marketplace. Such a knowledge helps to identify industry trends aiding their own decisions when participating in Internet related industries.  Topics covered include online and traditional media industries, aspects of e-commerce and marketing, open source software and crowd-sourcing. A highly effective way to gain such knowledge is by covering a relevant topic in an academic essay. This way the students will also improve their writing skills, and learn better how to cover financial aspects of their chosen topic in a scholarly manner. [24L]\r\nPrerequisites: Minimum of 13.0 university credits.", "coursePrerequisites": "Minimum of 13.0 university credits.", "tags": ["Software", "Media", "Market"]}, "CCT406H5": {"courseTitleFull": "CCT406H5S - Capstone Design Project (SH) (SSc)", "courseDetails": "An applied project-based capstone course in which groups will be paired with an identified client with real-life needs in digital media creation.  Students will work in small cross-functional teams to develop and present proposals to client representatives and a panel of industry experts.  Students will also be taught the arts of networking, proposal writing and project management. [36P]Prerequisites: A minimum of 13.0 university credits including CCT204H5 or CCT260H5.", "coursePrerequisites": "A minimum of 13.0 university credits including CCT204H5 or CCT260H5.", "tags": ["Design", "Management", "Media"]}, "CCT411H5": {"courseTitleFull": "CCT411H5S - CCIT Internship II (SSc EXP)", "courseDetails": "This course is a practical internship and is available upon application from students registered in any CCIT program who have completed CCT410H5.  The course is intended for students who have the opportunity to continue their CCT410H5 internship for a second semester.  A report and presentation will be required at the end of the placement.  These, along with the employer's assessment, will provide the main part of the course mark.  [12S]Prerequisites: Completion of 13.0 university credits including CCT410H5 and a CGPA of 2.5 and permission of internship coordinator.", "coursePrerequisites": "Completion of 13.0 university credits including CCT410H5 and a CGPA of 2.5 and permission of internship coordinator.", "tags": ["Programming", "Internship"]}, "CCT417H5": {"courseTitleFull": "CCT417H5S - Alternative Media (SSc)", "courseDetails": "This course examines the history, politics and aesthetics of a range of alternative, underground and radical media, as well as their relation to mainstream media. Students will study and experiment with a range of alternative media, including zines, graffiti, hacking, and culture jamming, for example. Students will gain hands-on experience in the creation of alternative media. [24S]Prerequisites: Minimum of  university 13.0 credits.", "coursePrerequisites": "Minimum of  university 13.0 credits.", "tags": ["Politics", "Media"]}, "CCT418H5": {"courseTitleFull": "CCT418H5S - Work, Media and Technology (SSc)", "courseDetails": "The course analyses the political, historical, and technical relationships between media, technology, and work in contemporary capitalism. The course will examine the power and social relationships that structure work in contexts such as media, creative industries, and the platform or \"gig\" economy. The course will focus on critical theories of work and will engage with case studies of the intersection of work, media and technology. The aim of the course is to build a tool kit for encountering an increasingly casualized and digitally-mediated labour market. [24S]Prerequisites: CCT222H5 or CCT319H5", "coursePrerequisites": "CCT222H5 or CCT319H5", "tags": ["Politics", "Media", "Market"]}, "CCT431H5": {"courseTitleFull": "CCT431H5S - Drones, Robots, Artificial Intelligence (SSc)", "courseDetails": "Drones, robots, and artificial intelligence are three interrelated technologies that are changing the most fundamental considerations of how society and sociality should operate. Work, war, consumption, and even love are being reconfigured. This course will address debates concerning the cultural, political, economic, military, and economic considerations surrounding the growing use of these technologies. [24L]Prerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": ["Politics"]}, "CCT434H5": {"courseTitleFull": "CCT434H5S - Design Thinking II (SH) (SSc)", "courseDetails": "An advanced project-based seminar on the art and creative directions of design thinking.  Combining traditional and innovative creativity methods, a variety of design projects are conceptualized and drafted for proposal or implementation.  This course embraces design thinking as a holistic, interdisciplinary approach that integrates methodical creativity and overarching design principles, such as aesthetics, futures-thinking, progress and metadesign. [36L]Prerequisites: CCT204H5", "coursePrerequisites": "CCT204H5", "tags": ["Design"]}, "CCT449H5": {"courseTitleFull": "CCT449H5S - Immersive VR Journalism (SH) (SSc)", "courseDetails": "This course focuses on creating digitally produced stories designed to provide a first-person, interactive experience with news events, animation and documentary film. 3D gaming, 3D drawing tools, and immersive technologies will be used to engage the audience member, creating a sense of 'presence'. Four theoretical domains will be discussed as part of a new narrative design framework foundational to Immersive VR Journalism: VR presence, narrative, cognition and journalistic ethics. [36P]Prerequisites: CCT312H5 or CCT351H5 or CCT353H5 or CCT357H5", "coursePrerequisites": "CCT312H5 or CCT351H5 or CCT353H5 or CCT357H5", "tags": ["Design"]}, "CCT451H5": {"courseTitleFull": "CCT451H5S - Digital Media: Advanced Audio Production (SH) (HUM)", "courseDetails": "This course explores how to design and produce a soundtrack for film or television.  The foundations of technical theory and nomenclature will be provided, as well as aesthetic guidelines.  Practical exercises will explore: voice recording, use of library sound effects, creative sound design, sound editing and processing technology and soundtrack mixing. [36P]Prerequisites: CCT353H5", "coursePrerequisites": "CCT353H5", "tags": ["Design", "Media"]}, "CCT452H5": {"courseTitleFull": "CCT452H5S - Graphic Design and Popular Culture (SH) (SSc)", "courseDetails": "This course will continue from where History and Practice of Design leaves off; from the beginning of the Post-Modern period or c.1975. It will study the history of graphic design to the present in roughly chronological order; it will focus on specific topics rather than on movements, schools or chronological events.  Topics will highlight how social trends, political forces, technological innovation and continuing folk traditions all contribute to the visual environment we all inhabit today.  Topics will emphasize popular culture as a force shaping graphic design while also referring to a theoretical graphic design discourse. [36L]Prerequisites: CCT204H5 and CCT352H5", "coursePrerequisites": "CCT204H5 and CCT352H5", "tags": ["Design", "Politics"]}, "CCT454H5": {"courseTitleFull": "CCT454H5S - Documentary Practices  (HUM)", "courseDetails": "This course explores the form and practice of documentary.  Objectivity, ethics, censorship, representation, reflexivity, responsibility to the audience and authorial voice will be examined.  Students will engage in practical engagement with documentary forms including the expanded field of documentary using tools such as photography, audio, video, 360 video, VR and new technologies. [36P]Prerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": "No Tags"}, "CCT457H5": {"courseTitleFull": "CCT457H5S - Digital Media:  Advanced Photography Production (SH) (SSc)", "courseDetails": "This course focuses on advanced theoretical and practical aspects of digital image production and editing. Production techniques, professional practices and workflows, the relationship of form to content, and digital darkroom strategies will be investigated. Over the course of the term students will work individually and in teams to create and edit images using professional grade digital technologies. [48P]Prerequisites: CCT357H5", "coursePrerequisites": "CCT357H5", "tags": ["Media"]}, "CCT460H5": {"courseTitleFull": "CCT460H5S - Advanced Web Design (SH) (SSc)", "courseDetails": "This course builds on the client-side web development skill of the Intermediate Web Design courses by adding a server-side programming and database design component.  Students will learn the theoretical and practical aspects of implementing a database including data modelling, development, communication and security.  Additionally, server-side programming will be introduced as a means of communication and interaction between client-side web pages and database data, allowing students to develop a dynamic database driven website. [36P]Prerequisites: CCT260H5 and CCT360H5Recommended Prep: Solid experience with static HTML is mandatory.  Previous exposure to the logic of a programming language is advised.", "coursePrerequisites": "CCT260H5 and CCT360H5Recommended Prep: Solid experience with static HTML is mandatory.  Previous exposure to the logic of a programming language is advised.", "tags": ["Programming", "Design", "Media"]}, "CCT480H5": {"courseTitleFull": "CCT480H5S - User Experience Analysis - UXA  (SSc EXP)", "courseDetails": "The course investigates how people interact with interactive digital systems from an evaluation and formal testing perspective, and introduces students to the methods of User Experience Assessment and User Experience Analysis (UXA).  This studio-based experiential course examines how interactive systems are implemented and deployed to meet users' needs,  with a focus on formal Human Computer Interaction (HCI) evaluation methods. Students will acquire the capacity to evaluate systems and to critically assess different HCI and UX validation methods which are based on industry approaches carried out by User Research Analysis. [36P]Prerequisites: A minimum of 13.0 university credits including CCT380H5.", "coursePrerequisites": "A minimum of 13.0 university credits including CCT380H5.", "tags": ["Human", "Research", "Experiential"]}, "CCT481H5": {"courseTitleFull": "CCT481H5S - Augmented Places and Social Media Spaces  (SSc)", "courseDetails": "Increasingly we are seeing a hybridization of information and location, where media provide a framework or environment for users (participants) to construct reality and relationships. The course explores emergence of new ubiquitous communication practices and the increasingly pervasive use of technology for the augmentation of people, places, and objects. In this course, students will explore various approaches to context-based information systems, and the shaping of social media spaces. [24L]\r\n \r\nPrerequisites: A minimum of 13.0 university credits.", "coursePrerequisites": "A minimum of 13.0 university credits.", "tags": ["Media"]}, "CCT482H5": {"courseTitleFull": "CCT482H5S - Interactive Electronic Design (SH) (SSc)", "courseDetails": "This course investigates the emerging field of critical making, which encourages students to approach social, communication and cultural issues through material engagement versus the literal and oral media more traditionally used in social science research.  Students will not only explore core tensions and challenges regarding technology's role and influence in society, but engage these challenges directly through the design and physical creation of alternative technological prototypes.  Basic mechanics, electronics and programming will be taught, with an understanding that thinking materially is rare for many most social science students. No previous knowledge is assumed. [36P]Prerequisites: Minimum of 13.0 university credits.", "coursePrerequisites": "Minimum of 13.0 university credits.", "tags": ["Programming", "Design", "Research", "Media"]}, "CCT485H5": {"courseTitleFull": "CCT485H5S - User Experience Design - UXD (SSc EXP)", "courseDetails": "The focus of the course is on understanding the experiences of users and their communities as affected by their interaction with digital technologies in information-centric societies. Students will learn the theoretical framework and practical aspects of advanced user-centred design principles (such as participatory design and techno-centric ethnographies). This course will represent an opportunity for students to enrich their understanding of the deep interconnections between human factors, human needs, interactive technologies, information, as projected on several dimensions: cultural, societal, ergonomic, and economic. [36P]\r\nPrerequisites: A minimum of 13.0 university credits including CCT380H5.", "coursePrerequisites": "A minimum of 13.0 university credits including CCT380H5.", "tags": ["Design", "Human"]}}